app/Services/AcademicYearService.php

    public function getActiveAcademicYear()
    {
        $year = $this->academicYearModel
            ->where('is_active', 1)
            ->first();

        if (!$year) {
            return null;
        }

        $year = $this->asArray($year);

        // Get class count
        $year['class_count'] = $this->classModel
            ->where('academic_year_id', $year['id'])
            ->countAllResults();
---
SELECT *
FROM `academic_years`
WHERE `is_active` = 1
AND `academic_years`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `classes`
WHERE `academic_year_id` = '2'
AND `classes`.`deleted_at` IS NULL

    public function getAcademicYearStatistics()
    {
        // Pakai table builder biar tidak “ketularan” state query model sebelumnya
        $total  = $this->db->table('academic_years')->where('deleted_at', null)->countAllResults();
        $active = $this->db->table('academic_years')->where('deleted_at', null)->where('is_active', 1)->countAllResults();

        $stats = [
            'total'       => (int) $total,
            'active'      => (int) $active,
            'by_semester' => [],
        ];

        // Get count by semester
        $semesterStats = $this->db->table('academic_years')
            ->select('semester, COUNT(id) as total')
            ->where('deleted_at', null)
            ->groupBy('semester')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `academic_years`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `academic_years`
WHERE `deleted_at` IS NULL
AND `is_active` = 1
SELECT `semester`, COUNT(id) as total
FROM `academic_years`
WHERE `deleted_at` IS NULL
GROUP BY `semester`

    public function getSuggestedAcademicYear()
    {
        // Lebih stabil: ambil terbaru dari end_date
        $latest = $this->academicYearModel
            ->where('deleted_at', null)
            ->orderBy('end_date', 'DESC')
            ->orderBy('start_date', 'DESC')
            ->first();
---
SELECT *
FROM `academic_years`
WHERE `deleted_at` IS NULL
AND `academic_years`.`deleted_at` IS NULL
ORDER BY `end_date` DESC, `start_date` DESC
 LIMIT 1