app/Services/ClassService.php

SELECT `classes`.*, `academic_years`.`year_name`, `academic_years`.`semester`, `academic_years`.`start_date`, `academic_years`.`end_date`, `homeroom`.`full_name` as `homeroom_name`, `homeroom`.`email` as `homeroom_email`, `homeroom`.`phone` as `homeroom_phone`, `counselor`.`full_name` as `counselor_name`, `counselor`.`email` as `counselor_email`, `counselor`.`phone` as `counselor_phone`
FROM `classes`
JOIN `academic_years` ON `academic_years`.`id` = `classes`.`academic_year_id`
LEFT JOIN `users` as `homeroom` ON `homeroom`.`id` = `classes`.`homeroom_teacher_id`
LEFT JOIN `users` as `counselor` ON `counselor`.`id` = `classes`.`counselor_id`
WHERE `classes`.`deleted_at` IS NULL
AND `classes`.`id` = 1
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `class_id` = 1
AND `status` = 'Aktif'
AND `deleted_at` IS NULL
AND `students`.`deleted_at` IS NULL
SELECT `gender`, COUNT(*) as count
FROM `students`
WHERE `class_id` = 1
AND `status` = 'Aktif'
AND `deleted_at` IS NULL
GROUP BY `gender`
---
    public function getClassById($id)
    {
        // FIX UTAMA: "classes.," -> "classes.*" (atau gunakan array select biar lebih aman)
        $class = $this->classModel
            ->select([
                'classes.*',
                'academic_years.year_name',
                'academic_years.semester',
                'academic_years.start_date',
                'academic_years.end_date',
                'homeroom.full_name as homeroom_name',
                'homeroom.email as homeroom_email',
                'homeroom.phone as homeroom_phone',
                'counselor.full_name as counselor_name',
                'counselor.email as counselor_email',
                'counselor.phone as counselor_phone',
            ])
            ->join('academic_years', 'academic_years.id = classes.academic_year_id')
            ->join('users as homeroom', 'homeroom.id = classes.homeroom_teacher_id', 'left')
            ->join('users as counselor', 'counselor.id = classes.counselor_id', 'left')
            ->find((int) $id);

        if (!$class) {
            return null;
        }

        $class = $this->asArray($class);
        /** @var array $class */ // bantu Intelephense memahami tipe

        // Get student count (konsisten: hanya Aktif & tidak soft-deleted)
        $class['student_count'] = $this->studentModel
            ->where('class_id', (int) $id)
            ->where('status', 'Aktif')
            ->where('deleted_at', null)
            ->countAllResults();

        // Get gender distribution
        $genderStats = $this->db->table('students')
            ->select('gender, COUNT(*) as count')
            ->where('class_id', (int) $id)
            ->where('status', 'Aktif')
            ->where('deleted_at', null)
            ->groupBy('gender')
            ->get()
            ->getResultArray();

SELECT `students`.*, `users`.`full_name`, `users`.`email`, `users`.`phone`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id`
WHERE `students`.`class_id` = '1'
AND `students`.`status` = 'Aktif'
AND `students`.`deleted_at` IS NULL
ORDER BY `users`.`full_name` ASC
---
    public function getClassStudents($classId, $status = 'Aktif')
    {
        $builder = $this->studentModel
            ->select('students.*, users.full_name, users.email, users.phone')
            ->join('users', 'users.id = students.user_id')
            ->where('students.class_id', $classId);

        if ($status) {
            $builder->where('students.status', $status);
        }

        return $builder->orderBy('users.full_name', 'ASC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `classes`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
AND `classes`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `classes`
WHERE `deleted_at` IS NULL
AND `classes`.`deleted_at` IS NULL
SELECT `grade_level`, COUNT(id) as total
FROM `classes`
WHERE `deleted_at` IS NULL
GROUP BY `grade_level`
SELECT `major`, COUNT(id) as total
FROM `classes`
WHERE `deleted_at` IS NULL
AND major IS NOT NULL
GROUP BY `major`
---
    public function getClassStatistics()
    {
        // Hindari countAllResults(false) karena bisa "nempel" kondisi query sebelumnya.
        $stats = [
            'total'    => $this->classModel->where('deleted_at', null)->countAllResults(),
            'active'   => $this->classModel->where('is_active', 1)->where('deleted_at', null)->countAllResults(),
            'by_grade' => [],
            'by_major' => [],
        ];

        // Get count by grade
        $gradeStats = $this->db->table('classes')
            ->select('grade_level, COUNT(id) as total')
            ->where('deleted_at', null)
            ->groupBy('grade_level')
            ->get()
            ->getResultArray();

        foreach ($gradeStats as $stat) {
            $stats['by_grade'][$stat['grade_level']] = (int) $stat['total'];
        }

        // Get count by major
        $majorStats = $this->db->table('classes')
            ->select('major, COUNT(id) as total')
            ->where('deleted_at', null)
            ->where('major IS NOT NULL', null, false)
            ->groupBy('major')
            ->get()
            ->getResultArray();

SELECT *
FROM `academic_years`
WHERE `academic_years`.`deleted_at` IS NULL
ORDER BY `year_name` DESC
---
    public function getAvailableAcademicYears()
    {
        return $this->academicYearModel
            ->orderBy('year_name', 'DESC')
            ->findAll();