app/Services/StudentService.php

SELECT `students`.*, `users`.`full_name` AS `full_name`, `users`.`email`, `users`.`username`, `users`.`phone`, `users`.`is_active`, `users`.`profile_photo` AS `profile_photo`, `classes`.`class_name`, `classes`.`grade_level`
FROM `students`
JOIN `users` ON `users`.`id` = `students`.`user_id` AND `users`.`deleted_at` IS NULL
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id` AND `classes`.`deleted_at` IS NULL
WHERE `students`.`deleted_at` IS NULL
AND `students`.`deleted_at` IS NULL
ORDER BY `students`.`created_at` DESC
---
    public function getAllStudents($filters = [], $perPage = 10, string $pagerGroup = 'default')
    {
        $builder = $this->studentModel
            ->asArray()
            ->select('students.*,
                      users.full_name AS full_name, users.email, users.username, users.phone, users.is_active,
                      users.profile_photo AS profile_photo,
                      classes.class_name, classes.grade_level')
            ->join('users', 'users.id = students.user_id AND users.deleted_at IS NULL')
            ->join('classes', 'classes.id = students.class_id AND classes.deleted_at IS NULL', 'left')
            ->where('students.deleted_at', null);