app/Services/StudentService.php

SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `deleted_at` IS NULL
AND `status` = 'Aktif'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `deleted_at` IS NULL
AND `status` = 'Alumni'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `deleted_at` IS NULL
AND `status` = 'Pindah'
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `deleted_at` IS NULL
AND `status` = 'Keluar'
SELECT `gender`, COUNT(id) as total
FROM `students`
WHERE `deleted_at` IS NULL
GROUP BY `gender`
SELECT `classes`.`grade_level`, COUNT(students.id) as total
FROM `students`
LEFT JOIN `classes` ON `classes`.`id` = `students`.`class_id` AND `classes`.`deleted_at` IS NULL
WHERE `students`.`deleted_at` IS NULL
AND `students`.`status` = 'Aktif'
GROUP BY `classes`.`grade_level`
---
    public function getStudentStatistics()
    {
        $total  = $this->db->table('students')->where('deleted_at', null)->countAllResults();
        $active = $this->db->table('students')->where('deleted_at', null)->where('status', 'Aktif')->countAllResults();
        $alumni = $this->db->table('students')->where('deleted_at', null)->where('status', 'Alumni')->countAllResults();
        $moved  = $this->db->table('students')->where('deleted_at', null)->where('status', 'Pindah')->countAllResults();
        $drop   = $this->db->table('students')->where('deleted_at', null)->where('status', 'Keluar')->countAllResults();

        $stats = [
            'total'       => (int) $total,
            'active'      => (int) $active,
            'alumni'      => (int) $alumni,
            'moved'       => (int) $moved,
            'dropped'     => (int) $drop,
            'by_gender'   => [],
            'by_grade'    => [],
            'by_religion' => [],
        ];

        // by gender
        $genderStats = $this->db->table('students')
            ->select('gender, COUNT(id) as total')
            ->where('deleted_at', null)
            ->groupBy('gender')
            ->get()->getResultArray();
        foreach ($genderStats as $g) {
            $stats['by_gender'][$g['gender'] ?? ''] = (int) $g['total'];
        }

        // by grade (kelas aktif)
        $gradeStats = $this->db->table('students')
            ->select('classes.grade_level, COUNT(students.id) as total')
            ->join('classes', 'classes.id = students.class_id AND classes.deleted_at IS NULL', 'left')
            ->where('students.deleted_at', null)
            ->where('students.status', 'Aktif')
            ->groupBy('classes.grade_level')
            ->get()->getResultArray();

SELECT `religion`, COUNT(id) as total
FROM `students`
WHERE `deleted_at` IS NULL
AND religion IS NOT NULL
GROUP BY `religion`
---
        }

        // by religion
        $religionStats = $this->db->table('students')
            ->select('religion, COUNT(id) as total')
            ->where('deleted_at', null)
            ->where('religion IS NOT NULL', null, false)
            ->groupBy('religion')
            ->get()->getResultArray();

SELECT `classes`.*, `academic_years`.`year_name` AS `year_label`
FROM `classes`
JOIN `academic_years` ON `academic_years`.`id` = `classes`.`academic_year_id` AND `academic_years`.`deleted_at` IS NULL
WHERE `classes`.`is_active` = 1
AND `classes`.`deleted_at` IS NULL
AND `classes`.`deleted_at` IS NULL
ORDER BY `classes`.`grade_level` ASC, `classes`.`class_name` ASC
---
    public function getAvailableClasses($academicYearId = null)
    {
        $builder = $this->classModel->select('classes.*, academic_years.year_name AS year_label')
            ->join('academic_years', 'academic_years.id = classes.academic_year_id AND academic_years.deleted_at IS NULL')
            ->where('classes.is_active', 1)
            ->where('classes.deleted_at', null);

        if ($academicYearId) {
            $builder->where('classes.academic_year_id', $academicYearId);
        }

        return $builder->orderBy('classes.grade_level', 'ASC')
            ->orderBy('classes.class_name', 'ASC')
            ->findAll();

SELECT *
FROM `roles`
WHERE `role_name` = 'Orang Tua'
 LIMIT 1
SELECT *
FROM `users`
WHERE `role_id` = '6'
AND `is_active` = 1
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
ORDER BY `full_name` ASC
---
    public function getAvailableParents()
    {
        $parentRole = $this->roleModel->asArray()->where('role_name', 'Orang Tua')->first();
        if (!$parentRole) return [];

        return $this->userModel
            ->asArray()
            ->where('role_id', $parentRole['id'])
            ->where('is_active', 1)
            ->where('deleted_at', null)
            ->orderBy('full_name', 'ASC')
            ->findAll();

SELECT `id`
FROM `roles`
WHERE `role_name` = 'Siswa'
 LIMIT 1
SELECT `u`.`id`, `u`.`full_name`, `u`.`email`, `u`.`username`
FROM `users` `u`
LEFT JOIN `students` `s` ON `s`.`user_id` = `u`.`id` AND `s`.`deleted_at` IS NULL
WHERE `u`.`role_id` = 5
AND `u`.`is_active` = 1
AND `u`.`deleted_at` IS NULL
AND `s`.`id` IS NULL
ORDER BY `u`.`full_name` ASC
---
    public function getAvailableStudentUsers(?string $q = null): array
    {
        $role = $this->roleModel->select('id')->where('role_name', 'Siswa')->first();
        $role = $this->asArray($role);
        if (!$role) return [];

        $builder = $this->db->table('users u')
            ->select('u.id, u.full_name, u.email, u.username')
            ->join('students s', 's.user_id = u.id AND s.deleted_at IS NULL', 'left')
            ->where('u.role_id', (int) $role['id'])
            ->where('u.is_active', 1)
            ->where('u.deleted_at', null)
            ->where('s.id', null);

        if ($q) {
            $builder->groupStart()
                ->like('u.full_name', $q)
                ->orLike('u.email', $q)
                ->orLike('u.username', $q)
            ->groupEnd();
        }

        return $builder->orderBy('u.full_name', 'ASC')->get()->getResultArray();