app/Services/UserService.php

SELECT COUNT(id) as c
FROM `users`
WHERE `deleted_at` IS NULL
SELECT COUNT(id) as c
FROM `users`
WHERE `deleted_at` IS NULL
AND `is_active` = 0
SELECT `roles`.`role_name`, COUNT(users.id) as total
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`deleted_at` IS NULL
GROUP BY `roles`.`id`
---
    public function getUserStatistics()
    {
        $total = (int) $this->db->table('users')
            ->select('COUNT(id) as c')
            ->where('deleted_at', null)
            ->get()->getRow('c');

        $active = (int) $this->db->table('users')
            ->select('COUNT(id) as c')
            ->where(['deleted_at' => null, 'is_active' => 1])
            ->get()->getRow('c');

        $inactive = (int) $this->db->table('users')
            ->select('COUNT(id) as c')
            ->where(['deleted_at' => null, 'is_active' => 0])
            ->get()->getRow('c');

        $roleStats = $this->db->table('users')
            ->select('roles.role_name, COUNT(users.id) as total')
            ->join('roles', 'roles.id = users.role_id', 'left')
            ->where('users.deleted_at', null)
            ->groupBy('roles.id')
            ->get()
            ->getResultArray();

SELECT *
FROM `roles`
ORDER BY `role_name` ASC
---
    public function getRoles()
    {
        return $this->roleModel
            ->asArray()
            ->orderBy('role_name', 'ASC')
            ->findAll();

SELECT `id`, `class_name`
FROM `classes`
WHERE `classes`.`deleted_at` IS NULL
ORDER BY `class_name` ASC
---
    public function getClasses(): array
    {
        return $this->classModel
            ->asArray()
            ->select('id, class_name')
            ->orderBy('class_name', 'ASC')
            ->findAll();