app/Controllers/Admin/RoleController.php

SELECT `r`.*, COUNT(rp.id) AS permission_count
FROM `roles` `r`
LEFT JOIN `role_permissions` `rp` ON `rp`.`role_id` = `r`.`id`
GROUP BY `r`.`id`
ORDER BY `r`.`role_name` ASC
---
    public function index()
    {
        require_permission('manage_roles');

        $roles = $this->db->table('roles r')
            ->select('r.*, COUNT(rp.id) AS permission_count')
            ->join('role_permissions rp', 'rp.role_id = r.id', 'left')
            ->groupBy('r.id')
            ->orderBy('r.role_name', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `roles`
WHERE `roles`.`id` = 3
SELECT `permission_id`
FROM `role_permissions`
WHERE `role_id` = 3
---
    public function edit(int $id)
    {
        require_permission('manage_roles');

        $role = $this->roleModel->find($id);
        if (! $role) {
            return redirect()->to(base_url('admin/roles'))
                ->with('error', 'Role tidak ditemukan.');
        }

        // kolom yang benar adalah permission_name
        $permissions = $this->permModel->orderBy('permission_name', 'ASC')->findAll();

        $assignedIds = array_column(
            $this->db->table('role_permissions')
                ->select('permission_id')
                ->where('role_id', $id)
                ->get()->getResultArray(),
            'permission_id'
        );