app/Controllers/Admin/UserController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role_id` = 1
AND `users`.`deleted_at` IS NULL
---

        $adminCount = 0;
        if ($adminRoleId) {
            $adminCount = (int) $this->userModel->where('role_id', $adminRoleId)->countAllResults();