app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        helper('settings');

        $session = service('session');
        $now     = time();

        // Timeout idle (menit) dari Settings -> detik
        $maxIdle = (int) setting('session_timeout_minutes', 120, 'security') * 60;

        // Cek idle sebelum memperbarui jejak
        $last = (int) ($session->get('last_activity') ?? $now);
        if ($maxIdle > 0 && ($now - $last) > $maxIdle) {
            $session->destroy();
            return redirect()->to('/auth/login')->with('error', 'Sesi berakhir, silakan login kembali.');
        }
        // Perbarui jejak aktivitas
        $session->set('last_activity', $now);

        // Wajib login
        if (! $session->get('is_logged_in')) {
            $session->set('redirect_url', current_url());
            return redirect()->to('/auth/login')->with('error', 'Silakan login terlebih dahulu untuk mengakses halaman ini.');
        }

        // Akun harus aktif
        $userId = $session->get('user_id');
        if ($userId) {
            $userModel = new \App\Models\UserModel();
            $user      = $userModel->find($userId);