app/Views/layouts/partials/topbar.php

SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0
AND `notifications`.`deleted_at` IS NULL
SELECT *
FROM `notifications`
WHERE `user_id` = 1
AND `notifications`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
---

if ($__uid && class_exists(\App\Models\NotificationModel::class)) {
    $__model  = new \App\Models\NotificationModel();
    $__unread = (int) $__model->where('user_id', $__uid)->where('is_read', 0)->countAllResults();
    $__items  = $__model->where('user_id', $__uid)->orderBy('created_at', 'DESC')->findAll(10);